[
    {
        "title": "US Might “Print” $900B Without Selling a Single Ounce of Gold – And BTC Could Be the Biggest Winner",
        "text": "Global finance is getting shaky again. Traditional tools are losing their punch, and now the US is openly talking about a move straight out of the history books — **gold monetization**.\n\nHere’s the play:\n\n* The US holds **261.5M ounces of gold**, officially valued at $42/oz (1973 prices 🤯).\n* Market price today: **$3,300+/oz**.\n* If revalued, Treasury could issue gold certificates at the new price to the Fed, instantly crediting **\\~$900B** without selling a single bar.\n* No new debt, just… magic money backed by gold.\n\nIt’s been done before:\n\n* **1933:** FDR confiscated gold, raised price by 69%, pumped cash into the economy.\n* **1971–73:** Nixon ended gold-dollar convertibility, Treasury revalued, pocketed \\~$800M without selling gold.\n\nWhy now?\n\n* Fed’s own memo (Aug 1) points to other countries doing it — Germany, Italy, Lebanon, South Africa.\n* Analysts like Luke Gromen say revaluing to **$20K/oz** could free up **$5T**, slashing US debt-to-GDP from 122% → \\~70%.\n* Trump’s Treasury officials are hinting it’s “on the table.”\n\nThe crypto twist:\n\n* Last year, Sen. Cynthia Lummis floated using revalued gold profits to **buy Bitcoin** for a US strategic reserve — “budget-neutral.”\n* Trump’s crypto advisor called it “the best way” to get BTC without taxing Americans.\n\nWhy this matters for Bitcoin:\n\n1. If fiat confidence drops, capital looks for hard assets — gold *and* BTC.\n2. State-level BTC accumulation could push it into a **reserve asset class**.\n3. But… big players = big control risks: more regulation, less freedom, political capture.\n\nBottom line:  \nGold monetization might be sold as a “smart debt fix,” but it’s still stealth money printing. If it happens, we could see:\n\n* **Short-term:** BTC moon fuel 🚀\n* **Long-term:** A fight for BTC’s soul — decentralized freedom vs. state-controlled asset.",
        "upvotes": 39,
        "comments": 14,
        "sentiment": 0.9959
    },
    {
        "title": "Moon Week 64",
        "text": "Welcome to Moon Week for round 64 of Moons! For more information about Moons, please [see our wiki page here](https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki). \n\nWe are using Snapshot for voting directly with the Moon balance in your wallet, in a transparent and open manner. For now all Moons held in self-hosted wallets at the time of poll creation will be eligible to vote, so if you are holding Moons on an exchange, the telegram TipBot or in a wallet that you are not comfortable connecting to snapshot then please be sure to transfer your Moons to a self-hosted wallet that you are comfortable connecting to snapshot before each Moon Week. \n\nFor more information about governance polls, please [see the Moons Wiki here](https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki/#wiki_governance).\n\n\n## Moons Discord\n \nWe have [launched a Moons Discord](https://www.reddit.com/r/CryptoCurrency/comments/1jiv9ce/introducing_the_moons_discord/)! Come [join our new community here](https://discord.gg/ZuU9Gqeqmy). \n\n* Sign up for notifications for Moons news, governance polls, or events. \n* Check out the #burns channel to see burns in real time\n* Check out the Moons tipbot kindly run by the telegram bot dev\n\n\n# Governance Polls\n\nHere's your poll(s) for this round of Moons:\n\n* [CCIP-115 - Moons Trading Contest](https://snapshot.box/#/s:cryptomods.eth/proposal/0x2c5aff8a48e77622fcb58982ec1d586f272b8986255286cc2089446b44d82c84) - [(Discussion Link)](https://www.reddit.com/r/CryptoCurrency/comments/1m8nv6f/ccip115_moons_trading_contest/)\n* [CCIP-116 - Adjust the CC Supporter program](https://snapshot.box/#/s:cryptomods.eth/proposal/0xbd99362fe9aa359db02a2ed0c1ac660fbbebfe1f2a897680f29668b269ba9bed) - [(Discussion Link)](https://www.reddit.com/r/CryptoCurrency/comments/1m8nw75/ccip116_adjust_the_cc_supporter_program/)\n\n# Previous Polls and results\n* **Passed** [CCIP-114 - Daily Discussion Time](https://snapshot.box/#/s:cryptomods.eth/proposal/0xb28254866020e587aa831031ef4541aee78126ee8ab34c410c9ca0b26e6f9cc6) - [(Discussion Link)](https://www.reddit.com/r/CryptoCurrency/comments/1lkzito/ccip114_daily_discussion_time/)\n\nYou can view [the full CCIP list here](https://docs.google.com/spreadsheets/d/1LhhqB4UAezNMdAwjV3evFXPD2x1JFCFHdnm8rmyRqAE/edit?usp=sharing). For push notifications about polls, [join our discord](https://discord.gg/ZuU9Gqeqmy) and visit the #subscriptions channel\n\n----------\n\n#Distributions\n\nPlease review [this snapshot report](https://1drv.ms/x/c/dcb53f391cee5d9a/EVX8NSzjiO1Gi_13TXW9RGgBwiRNEVgelX58qzJeuZNfXw?e=2OmqR2) to determine your expected MOON earnings from the past 28 days.\n\nReceipts for your comment and post earnings can be found on the report tab named \"Snapshot Data\". \n\nIf you believe you have identified any distribution errors, please send a message to mod mail for our team to review\n\nTo find your balance, please go [here](https://www.reddit.com/message/compose/?to=CommunityCurrencyBot&subject=Balance%20Inquiry&message=Please%20show%20my%20Community%20Currency%20balances).\nFor the latest guide on every other bot command, click [here](https://www.reddit.com/r/CryptoCurrency/s/KFyhlHHygn)",
        "upvotes": 29,
        "comments": 189,
        "sentiment": 0.9935
    },
    {
        "title": "Took profits for first time since 2016",
        "text": "Today I took profits for the first time ever. I’ve rode the coaster up and down since 2016 always holding and today I pulled the trigger and sold off 10% of my holdings. \n\nIt felt incredible once the deposit hit my bank account and I just want to encourage people to do the same. If you are struggling with the mindset of “it’ll be more in a year” I justified it with the fact that I can get hit by a car tomorrow and never see it. \n\nI sold off and felt like a huge winner locking in a large profit relative to what I invested especially when the mother in law (financial advisor) used to give me major shit about Crypto and then recently started asking my advice since she has clients asking about it.\n\nSo it’s a PSA - if you’re struggling to justify taking profits, just take the plunge and enjoy it. If you been here for a few cycles you understand the dread of not knowing if prices will ever rebound. \n\nIn the words of Kevin Malone, it was just nice to win one ",
        "upvotes": 68,
        "comments": 36,
        "sentiment": 0.9904
    },
    {
        "title": "Making my own phrase backup washers with laser…",
        "text": "Just did an experiment and I’m going to make my own backup washers using my laser and Enduramark (like Cermark) laser marking spray.\n\nIt’s extremely durable and basically fireproof.\n\nI won’t get into the nitty-gritty on how I’m keeping this secure (for brevity) but it’s roughly like this:\n\nFrom the BIP-39 I randomly (with a truly random randomized) picked 96 words.\n\nI transfer those to a non-internet connected computer and randomly replace 24 of them with my words.  Then still offline I lasered them onto washers.  I obviously won’t laser all 96 but they are all in the job in case someone gets a log from my laser (like if it phones home).\n\nThis results in about 145 bits of entropy.  So even if someone knew the 96 words, it would be pretty darn hard to do anything with them.\n\n\n\n",
        "upvotes": 129,
        "comments": 86,
        "sentiment": 0.9883
    },
    {
        "title": "Daily Crypto Discussion - August 12, 2025 (GMT+0)",
        "text": "**Welcome to the Daily Crypto Discussion thread. Please read the disclaimer and rules before participating.**\n\n \n\n# Disclaimer:\n\nConsider all information posted here with several liberal heaps of salt, and always cross check any information you may read on this thread with known sources. Any trade information posted in this open thread may be highly misleading, and could be an attempt to manipulate new readers by known \"pump and dump (PnD) groups\" for their own profit. BEWARE of such practices and exercise utmost caution before acting on any trade tip mentioned here.\n\n**Please be careful about what information you share and the actions you take.** Do not share the amounts of your portfolios (why not just share percentage?). Do not share your private keys or wallet seed. Use strong, non-SMS 2FA if possible. Beware of scammers and be smart. Do not invest more than you can afford to lose, and do not fall for pyramid schemes, promises of unrealistic returns (get-rich-quick schemes), and other common scams.\n\n \n\n# Rules:\n\n* All [sub rules](https://www.reddit.com/r/CryptoCurrency/about/rules/) apply in this thread. The prior exemption for karma and age requirements is no longer in effect.\n* Discussion topics must be related to cryptocurrency.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\n \n\n# Useful Links:\n\n* [**Beginner Resources**](https://www.reddit.com/r/CryptoCurrency/wiki/beginner_resources)\n* [**Intro to** **r/Cryptocurrency** **MOONs 🌔**](https://www.reddit.com/r/CryptoCurrency/comments/gj96lb/introducing_rcryptocurrency_moons/)\n* [**MOONs Wiki Page**](https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki/)\n* [**r/CryptoCurrency** **Discord**](https://discord.gg/ZuU9Gqeqmy)\n* [**r/CryptoCurrencyMemes**](https://www.reddit.com/r/cryptocurrencymemes)\n* [**Prior Daily Discussions**](https://www.reddit.com/r/CryptoCurrency/search?q=title%3A%22Daily+Crypto+Discussion+-+%22+&restrict_sr=on&sort=new&t=all) \\- (Link fixed.)\n* [**r/CryptoCurrencyMeta**](https://www.reddit.com/r/CryptoCurrencyMeta/) \\- Join in on all meta discussions regarding r/CryptoCurrency whether it be moon distributions or governance.\n\n \n\n# Finding Other Discussion Threads\n\nFollow a mod account below to be notified in your home feed when the latest r/CC discussion thread of your interest is posted.\n\n* u/CryptoDaily- — Posts the Daily Crypto Discussion threads.\n* u/CryptoSkeptics — Posts the Monthly Skeptics Discussion threads.\n* u/CryptoOptimists- — Posts the Monthly Optimists Discussion threads.\n* u/CryptoNewsUpdates — Posts the Monthly News Summary threads.",
        "upvotes": 12,
        "comments": 117,
        "sentiment": 0.9881
    },
    {
        "title": "‘Mysterious institution’ buys almost $1B worth of ETH over the past Week",
        "text": "A mysterious entity has been buying Ether (ETH) aggressively over the past week, purchasing 221,166 ETH worth almost $1 billion. This buying spree has contributed to Ethereum's market capitalization surpassing $523 billion, overtaking Mastercard's market cap. Publicly traded companies, such as BitMine Immersion Technologies and SharpLink Gaming, have also added over $1.3 billion worth of ETH to their treasuries. Analysts are bullish on ETH's price action, predicting it could reach $20,000 in the coming months, although some experts caution against over-leveraging the asset.\n\n",
        "upvotes": 424,
        "comments": 79,
        "sentiment": 0.8402
    },
    {
        "title": "What if I hold a little longer...",
        "text": "",
        "upvotes": 1809,
        "comments": 74,
        "sentiment": 0.0
    },
    {
        "title": "Ethereum is only 13% away now from the previous ATH, short liquidations stacked at $4700 with $1.32b on the line.",
        "text": "",
        "upvotes": 381,
        "comments": 41,
        "sentiment": 0.0
    },
    {
        "title": "Bitcoin will make history at $340K if BTC beats last cycle's 2,100% gains",
        "text": "",
        "upvotes": 221,
        "comments": 71,
        "sentiment": 0.0
    },
    {
        "title": "How Jack Dorsey’s new app lets you chat without the internet and why it matters",
        "text": "",
        "upvotes": 32,
        "comments": 20,
        "sentiment": 0.0
    }
]

